### Importing sqlite

In [2]:
import sqlite3

### Making connection object

In [29]:
conn = sqlite3.connect('test.db')

### Making cursor object to navigate through database

In [30]:
cur = conn.cursor()

### Creating table to be placed into database

In [6]:
cur.execute("""CREATE TABLE shoes (
           id INT,
           name VARCHAR(255),
           brand VARCHAR(255),
           max_available INT);
           """)

### Inserting data values into the table

In [13]:
cur.execute("""INSERT INTO shoes VALUES 
            (1, 'Air Jordan 1 - Banned', 'Jordan', 17),
             (2, 'Air Jordan 4 - Miltary Blue', 'Jordan', 13),
             (3, 'Samba - Rasta', 'Adidas', 14);
            """)

### Running a test query to check if data can retrieved

In [60]:
query = cur.execute("""SELECT * FROM shoes 
                        WHERE max_available 
                        BETWEEN 14 and 18;""")


for row in query:
    print (row)

(1, 'Air Jordan 1 - Banned', 'Jordan', 17)
(3, 'Samba - Rasta', 'Adidas', 14)
(5, 'Adidas Ultraboost 21 - Solar Red', 'Adidas', 14)
(9, 'Dunk Low', 'Nike', 15)
(10, 'Air Force 1 Low - White/White', 'Nike', 15)
(11, 'Air Force 1 Low - White/White', 'Nike', 15)
(5, 'Adidas Ultraboost 21 - Solar Red', 'Adidas', 14)
(9, 'Dunk Low', 'Nike', 15)
(10, 'Air Force 1 Low - White/White', 'Nike', 15)
(11, 'Air Force 1 Low - White/White', 'Nike', 15)

### Inserting additional values into 'shoes' table

In [34]:
cur.execute("""INSERT INTO shoes VALUES
                    (4, 'Air Jordan 6 - Infrared', 'Jordan', 11),
                    (5, 'Adidas Ultraboost 21 - Solar Red', 'Adidas', 14),
                    (6, 'Air Max 97 - Silver Bullet', 'Nike', 24),
                    (7, 'Air Jordan 4 - Fire Red', 'Jordan', 13),
                    (8, 'Yeezy Boost 350 V2 - Zebra', 'Adidas', 12),
                    (9, 'Dunk Low', 'Nike', 15),
                    (10, 'Air Force 1 Low - White/White', 'Nike', 15),
                    (11, 'Air Force 1 Low - White/White', 'Nike', 15)
                    ;
                    """)

### Seeing all values in 'shoes' table

In [36]:
query = cur.execute("""SELECT DISTINCT * FROM shoes;""")

for row in query:
    print (row)

(1, 'Air Jordan 1 - Banned', 'Jordan', 17)
(2, 'Air Jordan 4 - Miltary Blue', 'Jordan', 13)
(3, 'Samba - Rasta', 'Adidas', 14)
(4, 'Air Jordan 6 - Infrared', 'Jordan', 11)
(5, 'Adidas Ultraboost 21 - Solar Red', 'Adidas', 14)
(6, 'Air Max 97 - Silver Bullet', 'Nike', 24)
(7, 'Air Jordan 4 - Fire Red', 'Jordan', 13)
(8, 'Yeezy Boost 350 V2 - Zebra', 'Adidas', 12)
(9, 'Dunk Low', 'Nike', 15)
(10, 'Air Force 1 Low - White/White', 'Nike', 15)
(11, 'Air Force 1 Low - White/White', 'Nike', 15)

### Creating 'shoes_2' table

In [37]:
cur.execute("""CREATE TABLE shoes_2 (
        id INT,
        name VARCHAR(255),
        brand VARCHAR(255),
        max_available INT);
        """)

### Inserting additional values into 'shoes_2' table

In [38]:
cur.execute("""INSERT INTO shoes_2 VALUES
                    (1, 'Air Jordan 1 - Banned', 'Jordan', 16),
                    (2, 'Air Jordan 4 - Motorsport', 'Jordan', 11),
                    (3, 'Samba - White', 'Adidas', 14),
                    (4, 'Air Jordan 6 - Powder Blue', 'Jordan', 10),
                    (5, 'Adidas Ultraboost 21 - Solar Red', 'Adidas', 9),
                    (6, 'Air Max 97 - Silver Bullet', 'Nike', 24),
                    (7, 'Air Jordan 4 - Fire Red', 'Jordan', 13),
                    (8, 'Yeezy Boost 350 V2 - Oreo', 'Adidas', 12),
                    (9, 'Dunk Low', 'Nike', 15),
                    (10, 'Air Force 1 Low - Black', 'Nike', 15);
                    """)

### Joining 'shoes' table with 'shoes_2' table to see values that match

In [44]:
query = cur.execute("""SELECT DISTINCT s1.name 
                        FROM shoes as s1
                        INNER JOIN shoes_2 as s2
                        ON s1.name = s2.name
                        WHERE s1.name LIKE 'Air%';
                        """)

for row in query:
    print(row)

('Air Jordan 1 - Banned',)
('Air Max 97 - Silver Bullet',)
('Air Jordan 4 - Fire Red',)

### Querying 'shoes' table to see what shoe names contains the word 'Air'

In [51]:
query = cur.execute("""SELECT COUNT(name) 
                        FROM shoes 
                        WHERE name 
                        LIKE 'Air%';
                        """)

for row in query:
    if 12 in row:
        print('There are 12 rows with the word \"Air\".')
    print(row)

There are 12 rows with the word "Air".
(12,)

### Using conditional statements based on the total rows in the 'shoes_2' table

In [57]:
query = cur.execute("""SELECT
                            CASE 
                                WHEN COUNT(name) < 11 THEN 'The amount of rows is below 11'
                                WHEN COUNT(name) >= 11 THEN 'The amount of rows is at or above 11'
                            END AS result
                            FROM shoes_2;
                        """)
for row in query:
    print(row[0])

The amount of rows is below 11

### Inserting new data to change conditional output

In [58]:
cur.execute("""INSERT INTO shoes_2 VALUES
                    (11, 'Air Jordan 1 - Royal Blue', 'Jordan', 16);
                    """)

### Using conditional statements based on the total rows in the table

In [59]:
query = cur.execute("""SELECT
                            CASE 
                                WHEN COUNT(name) < 11 THEN 'The amount of rows is below 11'
                                WHEN COUNT(name) >= 11 THEN 'The amount of rows is at or above 11'
                            END AS result
                            FROM shoes_2;
                        """)
for row in query:
    print(row[0])

The amount of rows is at or above 11

### Commiting changes to database

In [61]:
conn.commit()

### Closing the connection to the database

In [62]:
conn.close()